###### Virtual Private Cloud #####
> VPC stands for Virtual Private Cloud
- It is logically isolated area of the AWS cloud
- We can have complete control over our virtual networking environment, including a selection of our IP address range, the creation of subnets, and configuration of route tables and network gateways.
- we can provide multiple layers of security, including security groups and NACL, to help control access to Amazon EC2 instances in each subnet.

### Architecture of VPC

=======================================
########### IMPLIED ROUTER ############ v2
> It is the central VPC routing function.
> It connects the different AZ's together and connects the VPC to the internet gateway.
> Each subnet will have a route table the router uses to forward traffic within the VPC. 
> The route tables will also have entries to external destinations.

> Route Table, NACL are part of IMPLIED ROUTER

##### ROUTE TABLES #######
> You can have up to 200 route tables per VPC
> We can have up to 50 routes entries per route table.
> EACH SUBNET MUST BE ASSOCIATED WITH ONLY ONE ROUTE TABLE at a given time.
> If you don't specify a subnet-to-route-table association, the subnet(when created) will be associated with the main(default) VPC route table.
> We can change the subnet associated to another route table.

> we can also edit the main (default) route table if we need, but 
- we cannot delete the main (default) route table.
- However, we can make a custom route table manually become the main route table, then we can delete the former main, as it is no longer a main route table.

> Every route table in a VPC comes with a default rule that allows all VPC subnets to communicate with one another
- we CANNOT modify or delete this rule.
- this entry contain 'CIDR block IP addr of VPC' in destination and target is local  
=======================================
######### VPC IP Addressing ########### v3

> ONCE THE VPC IS CREATED, WE CANN'T CHANGE ITS CIDR BLOCK RANGE. 
- The allowed block size is between a /16 netmask (65,536 IP addresses) and /28 netmask (16 IP addresses).

> MIN SIZE OF CIDR BLOCK IS /28 means out of 32bit, 28bit is taken by CIDR block and 4bit for host i.e. 2^4=16 IP can be use by host 

> MAX SIZE OF CIDR BLOCK IS /16 means out of 32bit, 16bit is taken by CIDR block and 6bit for host i.e. 2^6 IP can be use by host 

> If we need a different CIDR size, create a new VPC 

> The different subnet within a VPC can NOT overlap (basic TCP/IP rule) 
EXAMPLE: if a subnet X CIDR block is 10.0.0.0/24, it mean last 8 bit assign for host 
- Now we cannot have another subnet Y within the same VPC having 10.0.0.0/28 CIDR block because it is taking last 4 bit of subnet X

> we can however, expand VPC CIDR by adding new/extra IP addr ranges 

#### AWS Reserved IPs in each subnet

> First 4 IP addresses in each  subnet and the last one are reserved by AWS
- Ex if the subnet is 10.0.0.0/24 then 
10.0.0.0 is the base network 
10.0.0.1 VPC router 
10.0.0.2 DNS related 
10.0.0.3 Reserved for future use
10.0.0.255 last IP 

#### INTERNET GATEWAY #### 
> Is the gateway through which our VPC communicate with the internet and with other AWS services

Q> Is a horizontally scaled, redundant, and highly available VPC component
- it is manage be AWS itself 

> only 1 IG per VPC 

> It performs NAT(static one-to-one) between Private and Public (or Elastic) IPv4 address

> It supports both IPv4 and IPv6

#### Public Subnet Vs Private Subnet 

##Private IP address
10.0.0.0, 
172.16.0.0, 
192.168.0.0 

Routable IP addr

=======================================
########## SECURITY GROUPS ############ v6

> Any Virtual Server Instance(EC2) created must have a security group for it specified during its launch. you can either choose an existing one, or create a new security group during launch. 

> Each VPC created will have a default security group, 
- we CANNOT delete a default security group.

> SECURITY GROUPS ARE VPC RESOURCES, hence different EC2 instances, in different AZ, belonging to the same VPC, can have the same security group applied to them

> Changes to security groups take effect immediately. 

> A Security group can be used in different subnet 

####### TYPE OF SECURITY GROUPS #######

1. Default Security Group in a default or custom VPC, will have:
- Inbound rules allowing instances assigned the same security group to talk to one another 
- All outbound traffic is allowed 

2. Custom(Non-default) security groups in a VPC will always have:
- No Inbound rules - basically all inbound traffic is denied by default 
- All outbound traffic is allowed by default 

##### SECURITY GROUP CONFIGURATION ####
> we can use Security group names as the source or destination in other security group rules. 

> we can use the Security group name as the source in its own inbound security group rules. 

> Security group are directional and can use allow rules only 
> A security group set of rules end with an implicit deny any 

> we can use CIDR addr or another security group in the security group. 

#### Ques 

## To allow the EC2 instances assigned to a security group to communicate with one another, 
- create a security group, apply it to all these instances, and configure a rule that allows any traffic, on any protocol/ports, the source of which is the security group itself. 
- Be cautious that the security group is a VPC resource, which mean member EC2 instances can be from different subnet and AZs too. 


## To allow all EC2 instances on a subnet to communicate with each other,
- create a security group and apply it to those instances, and configure a rule that allows communication on all protocol/ports, the source of which is the subnet CIDR block 

=======================================
##### NETWORK ACCESS CONTROL LISTS #### 

> It is a function performed on the implied router (The implied VPC router hosts the NACL function) 

> It functions at the subnet level 

> NACL are stateless. 
- Outbound traffic for an allowed inbound traffic, must be explicitly allowed too 

> YOU CAN HAVE "PERMIT" AND "DENY" RULES IN A NACL

> NACL is a set of rules, each has a number  

> NACL rules are checked for a permit from lower numbered rules until either a permit is found or an explicit/implicit deny is reached. 

> you can insert rules (based on the configured rule number spacing) between existing rules, hence it is recommended to leave a number range between any two rules to allow for edits later. 

> NACL end with an explicit deny any, which we cannot delete. 

> A subnet must be associated with a NACL, if you do not specify the NACL, the subnet will get associated with the default NACL automatically. 

> we can create our own custom NACL, not necessary to use default 
> Default NACL allows all inbound and outbound traffic 

> A Custom NACL block/denies all inbound and outbound traffic by default 

## NOTE:
> Inbound in ACL means coming from outside the subnet destined to the subnet. 
- Outbound means going out of the subnet.

> Inbound for security group means inbound from outside the instance destined to the instance. 
- Outbound means going out of the instance ENI
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
## Ques 
## If an instance in a VPC is unable to communicate over a certain protocol/ports with anothe instance in the same VPC, then the problem is the security setting of :

- Security group or NACL of the source instance, and/or,
- Security group or NACL of the destination instance 

* The problem will never be routing table configuration, due to the default route entry .


>> NACL are stateless, to allow certain traffic through it, it need to be allowed( and the return traffic) in the inbound and outbound rules of the ACL. 
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 
=======================================
####### Security Group & NACL ######### v12

> CHANGES MADE TO NACLS (OR SECURITY GROUP) TAKE EFFECT IMMEDIATELY, so they are both quick to activate/defend as needed. 

> NACL help to block certain ranges of IP address from a large pool, becuase they do HAVE DENY RULES.
- SG cannot block a certain range of IP address from internet from getting to your EC2 fleet of instances 
======================================= 
## What is difference between Security group and NACL? 

> SG operates at the instance level (2nd line of defense i.e defense in depth)
- NACL operates at the subnet level (1nd line of defense)

> SG Support allow rules only 
- NACL supports allow and deny rules 

> SG IS STATEFUL i.e return traffic is automatically allowed regardless of any rules 
- NACL IS STATELESS : return traffic must be explicitly allowed by rule 

> SG, we evaluate all rules before deciding whether to allow traffic 
- NACL, we process rules in number order when deciding 

> SG Applies to an instance only if someone specifies the sG when launching the instance or associates the SG with the instance later on 
- NACL Automatically applies to all instances in the subnet its associated with (backup layer of defense, so you don't have to rely on someone specifying the SG) 

## Security GROUP format 
INBOUND - Type(DNS/HTTP/ICMP) - Protocol - PortRange - Source 
OUTBOUND - Type(DNS/HTTP/ICMP) - Protocol - PortRange - Dest 

##NACL format 
#INBOUND - Rule, Type, Protocol, PortRange, source, Allow/Deny
#OUTBOUND - Rule, Type, Protocol, PortRange, Destination, Allow/Deny, 
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 
#### TCP/IP PACKET HEADERS #### v13

DestIP - DestPort - SourceIP - SourcePort - payload
- Here SourcePort could be ephemeral 

=======================================
############# NAT Instance ############ V15 
> NAT instance place at public subnet
- it is normal EC2 instance but it is loaded with AMI that has NAT functionality 

> NAT instance is configured in a public subnet 

> NAT instance need to be assigned a security group

> NAT instance is there to enable the private subnet EC2 instance to get to the internet

> No traffic initiated from the internet can access the private subnet 

> Only admin SSH traffic can be allowed to the NAT instance (or RDP if windows) 

> Public subnet EC2 instance don't need to go through NAT 

#### NAT INSTANCE SECURITY GROUP ####
> Private subnet EC2 instances need to access websites on the internet (http/https)

> NAT instance SG must allow :
- Traffic inbound from the private subnet or the private subnet SG as a source on the ports 80(http) and 443(https) 

- Traffic outbound to 0.0.0.0/0 (internet) on ports 80 and 443 

- Traffic inbound from customer own network on port 22(ssh) to administer the NAT instance

######## NAT GATEWAY ##########

> It is a AWS managed service 

> Cannot be assigned a Security group 
> AWS is responsible for its security/patching etc 
> Works only with an Elastic IP, can not use a public IP to do it function 
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ 
## What is difference between NAT Gateway and NAT Instance?

> NAT Instance we manage it and launch it 
- NAT Gateway manage by AWS 

> NAT Instance we add Security group 
- NAT Gateway SG is managed by AWS 

> NAT instance works on public ip / elastic ip 
- NAT gateway works only on elastic ip 

=======================================
############# VPC WIZARD ############## v16 

> VPC with public and private subnets created by a VPC wizard will have: 
- by default, a public subnet associated with a custom route table and IGW
- by default, a private subnet associated with the main route table 
- An IGW created and attached to the VPC

- by default the wizard will prefer to create a NAT Gateway for your VPC, but you have the option to choose a NAT instance instead.  

> For launch of NAT instance the wizard need atleast M1 instance

> Main(default) VPC route table is assigned to the private subnet, it has the VPC local subnet routing entry and an entry 0.0.0.0/0 pointing to the NAT instance/gateway

> Custom route table will have an entry 0.0.0.0/0 pointing to internet gateway as a target

> NOTE : CREATING A VPC, CREATES ROUTE TABLE AND NOT ROUTING INSTANCE

> VPC created by VPC Wizard, by default creates NAT Gateway/instance 

> VPC with NAT instance cannot be deleted unless the user manually terminate those NAT instance 

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
## VPC wizard - public and VPN-only subnet

> Wizard created VPC with public and VPN-only subnet does not have a NAT instance or NAT gateway 

> Wizard created VPC will have
- Main route table associated with the the VPN-only subnet
- Custom route table associated with public subnet and pointing to the VPC IGW
- IGW created for the VPC
- VGW with VPN connection
- Route propagation enable for the main route table for exchanging route with the VGW dynamically
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
## Routing to on premise network
> A public and VPN-only subnet VPC created by the VPC wizard refer to the fact that no NAT instance(or gateway) will be created as part of the wizard configuration
- VPN-only mean a subnet that does not require access to the internet

> VPC main route table is associated with the VPN-only subnet
> VPC custom route table is associated with the public subnet
> VGW is the gateway the main table refer to for access to customer premise/data centre

## VPN-only subnet
> Configuring a VPC using the VPC wizard that has a VPN-only and VPN access implies:
- No public subnet 
- no NAT instance/gateway 
- it will create a virtual private gateway(VGW) but without an elastic IP 
- it will create a VPN connection
=======================================
############ VPC PEERING ############## v18
> VPC peering connection is a networking connection between 2 vpc that enable you to route traffic between them using private ipv4/IPv6 address

> Instance in another vpc can communicate with each other as if they are within same network

> You can create a vpc peering connection between your own vpc or with vpc in another AWS account within a single or between regions

> AWS use the existing infrastructure of a vpc to create a vpc peering connection
- it is neither a gateway nor a VPN and connection and does not rely on a separate piece of physical hardware

> There is no single point of failure for communication or a bandwidth bottleneck

> EXAMPLE of vpc peering connection usages:
- if you have more than one AWS account, you can peer the vpc across those account to create a file sharing network 
- you can also use a vpc peering connection to allow other VPC to access resources in your own vpc

## To establish a VPC peering connection you do the following: 
- the owner of requester VPC (or local vpc) send a request to the owner of peer VPC  
- EITHER OF VPC SHOULD NOT HAVE OVERLAP CIDR BLOCK 

> To enable the flow of traffic between the peer VPC, 
- use private IP address, 
- add route entry in VPC route table of both VPCs 
- if require update the SG rules to ensure that traffic to and from the peer VPC is not restricted 


> vpc peering connection is a one to one relationship between two vpc 
- you can create multiple vpc peering connection for each vpc that you own

> TRANSITIVE PEERING RELATIONSHIP ARE NOT SUPPORTED:
- you do not have any peering relationship with VPC that your vpc is not correctly peered with.

> Vpc peering does not support edge-to-EDGE routing

> You have a limit on the number of active(50) and pending vpc peering(25) connection that you can have per vpc

> we cannot have more than 1 VPC peering connection betw the same 2 VPCs at the same time. 

> A placement group can span period vpc
> Unicast reverse path forwarding in vpc peering connection is not supported

> vpc peering is not transitive 
- to allow 4 VPC to talk to each other 
- we need a full mesh among them 
- n(n-1)/2 vpc peering i.e 6 peering connection are required 
- what if there we have 20 or 30 VPC

=======================================
############ Transit Gateway ########## v19

> Transit gateway is a network transit hub that you can use to interconnect your VPC and on premise networks 

> it is a regional resource 
> VPC are allowed to communicate with one another and with on-premise CIDR block by default 

> this can be changed by creating multiple route table, associated different vpc with different routing table to limit/control who talk to whom 

> transitive gateway can be associated across accounts

> A VPC, an AWS direct connect gateway, or a VPN connection can be attached to a transit gateway

## Transit gateway route table
> Transit gateway has a default route table and can optionally have additional route table
> Route table includes dynamic and static routes that decide the next hop based on destination IP address of the packet

> The target of these rounds can be a vpc or a VPN connection
> by default the vpc and VPN connection that are attached to a transitwy are associated with the default transit gateway route table.

# Association
> Each attachment is associated with exactly one route table
> Each route table can be associated with zero or many attachment

# Route propagation
> A Vpc or VPN connection can dynamically propagate route to a transit gateway route table
> With a vpc, you can create static route to send traffic to the transit gateway
> With the VPN connection, route are propagated with the transit gateway on your on-premise router using border gateway protocol(BGP)